import { TranslationKey } from '../components/message/Message';

export const ua: Record<TranslationKey, string> = {
  'locations.irpin.shortLocation': 'Ірпінь',
  'locations.irpin.location': 'Ірпінь, Київська область',

  'header.liveTours': 'Тури',
  'header.vrPlaces': 'VR Місця',
  'header.aboutUs': 'Про нас',

  'card.liveNow': 'Наживо',
  'card.comingSoon': 'Далі буде',

  'heading.title': 'Війна як вона є',
  'heading.subtitle': 'Відчуй. Погрузись. Пожертвуй',
  'heading.description':
    'Ми показуємо світу справжню війну і даємо можливість зануритися в неї та відчути її.',

  'aboutUs.title': 'Про нас',

  'aboutUs.description1':
    'Ми – команда волонтерів, яка створила проєкт, спрямований на те, щоб світ побачив війну в Україні нашими очима, без редактури та правильних кадрів.',
  'aboutUs.description2':
    "На цьому сайті ви зможете поринути у грубу реальність сучасної війни, яка йде на території України, за допомогою VR турів та прямих трансляцій по зруйнованих російською армією цивільних та історико-культурних об'єктів.",
  'aboutUs.supportUs.title': 'Підтримайте наш проект',
  'aboutUs.supportUs.button': 'Зробити внесок у проект у ETH',
  'aboutUs.contactUs': 'Напишіть нам, якщо маєте запитання або пропозиції',

  'donate.amount': 'Введіть суму',
  'donate.continue': 'Продовжити',
  'donate.walletNeeded':
    'Вам потрібен Ethereum гаманець, щоб зробити внесок. Під’єднайте його за допомогою доступних провайдерів або створіть новий.',
  'donate.title': 'Підтримай Україну',
  'donate.title.to': 'Підримати',
  'donate.recipient.mincult.title':
    'Міністерство культури та інформаційної політики України',
  'donate.recipient.mincult.donate':
    'Зробити внесок до Міністерства культури та інформаційної політики України',
  'donate.recipient.mincult.description':
    "Щодня, російська армія, руйнує та знищує міста, села та пам'ятки культурно – історичної спадщини. Кожен ваш донат – допомагає Україні відновити розбиті школи, дитячі садочки та лікарні. Всі ваші кошти надходять напряму на офіційні рахунки Національного банку України.",
  'donate.recipient.dronarium.title': 'Дронаріум',
  'donate.recipient.dronarium.description':
    'DRONARIUM – це перший в Україні навчальний центр для пілотів дронів, де випускники отримують, практичний досвід керування БПЛА в найрізноманітніших умовах, поглиблене вивчення авіаційного права, законодавства України та міжнародного права у сфері БПЛА. Все це робить випускників академії - надійними захисниками Українського неба та точними очимами в небі. Ви можете підтримати академію та прискорити наближення перемоги – відправивши пожертву на будь-яку суму.',
  'donate.button.donate': 'Зробити внесок',
  'donate.recipient.dronarium.donate': 'Зробити внесок до DRONARIUM',
  'donate.recipient.wer.donate': 'Зробити внесок у проект',

  'vrplaces.title': 'VR місця',
  'vrplaces.seeAllPlaces': 'Подивитись всі місця',

  'team.andrienko.name': 'Юрій Андрієнко',
  'team.andrienko.position': 'COO',
  'team.VK.name': 'V K',
  'team.VK.position': 'CEO/Хаос',
  'team.revva.name': 'Сергій Ревва',
  'team.revva.position': 'Дизайн',
  'team.abduvaliiev.name': 'Рустам Абдувалієв',
  'team.abduvaliiev.position': 'Розробка',
  'team.pokhylenko.name': 'Олександр Похиленко',
  'team.pokhylenko.position': 'Розробка',
  'team.novyk.name': 'Іван Новик',
  'team.novyk.position': 'Cтворення VR контенту',
  'team.polikashkin.name': 'Андрій Полікашкін',
  'team.polikashkin.position': 'Cтворення VR контенту',

  'vrPlaces.an225': 'Аеропорт Гостомель, літак АН - 225 Мрія, Київська обл.',
  'vrPlaces.borodyanka': 'Місто Бородянка, Київська обл.',
  'vrPlaces.bucha': 'Місто Буча, Київська обл.',
  'vrPlaces.kapitanivka': 'Село Капітанівка, Київська обл.',
  'vrPlaces.priymachenko_museum':
    'село Іванків, Музей Примаченко, Київська обл.',
  'vrPlaces.rusaniv': 'Село Русанів, Київська обл.',
  'vrPlaces.vorzel': 'Ворзель, Київська обл.',
  'vrPlaces.irpin': 'Центральний будинок культури, Ірпінь, Київська обл.',
  'vrPlaces.gas_station': 'Заправка, Київська обл.',
  'vrPlaces.bucha_novus': 'Буча, супермаркет "Novus", Київська обл.',

  'home.title.liveTours': 'Тури',

  'location.title.moreLiveTours': 'Більше live турів',

  'footer.arr': 'Всі права захищено',

  'partners.title': 'Партнери',

  'locations.irpin': `Російські війська мали на меті оточити Київ з заходу, задля чого вони намагалися взяти контроль над містечками Ірпінь, Буча та Гостомель.
Російські військові знищили більше 50% Ірпеня та незліченну кількість цивільних. Правові органи та активісти й донині знаходять масові поховання людей, закатованих до смерті російськими військовими.
Київська область стримувала напад на Київ й зазнала лютих руйнувань від російської армії. Київська облдержадміністрація назвала містечка Буча, Ірпінь, Гостомель, Вишгород і трасу М06 найнебезпечнішими в області. Ірпінь отримав звання міста-героя України 24 березня 2022. Вічна слава героям.`,
};
